#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//写一段代码，判断当前字节序

//int cheak_sys()
//{
//	int a = 1;
//	//char* p = (char*)&a;
//	//return *p;
//	return *((char*)&a);
//	//1为小端，0为大端
//
//}
//
//int main()
//{
//	int i = cheak_sys();
//	
//	//int a = 1;
//	//char *p= (char *)&a;
//	//if ((*p) == 0)
//	//	printf("大端\n");
//	//else
//	//	printf("小端\n");
//
//	if (i)
//		printf("小端\n");
//	else
//		printf("大端\n");
//	return 0;
//}


//int main()
//{
//	char a = -1;
// 11111111补
// 11111111111111111111111111111111打印-补
//	signed char b = -1;
// 11111111补
// 11111111111111111111111111111111打印-补
//	unsigned char c = -1;
// 11111111补
// 11111111无符号char补
// 00000000000000000000000011111111无符号整型提升
// 00000000000000000000000011111111有符号打印
//	printf("a=%d,b=%d,c=%d", a, b, c);
//	return 0;
//}


//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111101111111
//	//11111111111111111111111110000000补
//	//char 10000000补
//	//11111111111111111111111110000000  有符号整型提升
//	printf("%u\n", a);
//	//11111111111111111111111110000000  无符号打印
//	//4294967168
//	return 0;
//}


//int main()
//{
//	char a = 128;
//	//10000000
//	//11111111111111111111111110000000整型提升
//
//	printf("%u\n", a);
//	return 0;
//}